---
type: DetailCurveArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# DetailCurveArray

`Autodesk.Revit.DB.DetailCurveArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | DetailCurveArray | — | `public DetailCurveArray ()` |
| Method | Append | — | `public virtual void Append ( DetailCurve item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual DetailCurveArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( DetailCurve item , int index )` |
| Method | ReverseIterator | — | `public virtual DetailCurveArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual DetailCurve this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |